00100  identification division.
00200  program-id. import-file.
00300
00400  procedure division.
00500
00600      perform imported-function.
00700
00800  stop run.
00900
01000  copy 'imported-file'.
02000
03000
04000
05000
06000
07000
08000
