010    find-summa-of-array.
020        move 0 to summa.
030
040        perform varying index-array from 1 by 1
050                until index-array > array-size
060            add array(index-array) to summa
070        end-perform.
