010    01 array occurs 5 times pic 9.
020    01 index-array pic 9.
030    01 array-size pic 9 value 5.
040    01 rem-value pic 9.
041    01 div-value pic 9.
042    01 array-result-i pic 9.
050    01 array-result occurs 3 times pic 9.
