010    summa-positive-array.
020        move 0 to summa-pos.
030
040        perform varying pos-index from 1 by 1
050                until pos-index > pos-array-size
060            add positive-array(pos-index) to summa-pos
070        end-perform.
