010    summa-negative-array.
020        move 0 to summa-neg.
030
040        perform varying neg-index from 1 by 1
050                until neg-index > neg-array-size
060            add negative-array(neg-index) to summa-neg
070        end-perform.
