010    01 array occurs 7 times pic s9.
020    01 index-array pic 9.
030    01 array-size pic 9 value 7.
040    01 positive-array occurs 4 times pic 9.
050    01 negative-array occurs 3 times pic s9.
060    01 pos-index pic 9.
070    01 neg-index pic 9.
080    01 summa-pos pic 99.
090    01 pos-array-size pic 9 value 4.
