023        01 array occurs 5 times pic 9.
024        01 index-array pic 99 value 1.
025        01 min-value pic 9.
026        01 array-size pic 99 value 3.
